###################1
# a = int(input("Введите начало диапазона для простых чисел:"))
# b = int(input("Введите конец диапазона для простых чисел:"))
# for i in range(a, b):
#     c = 0
#     d = 2
#     while d < i:
#         if i % d == 0:
#             c += 1
#         d += 1
#     if c == 0:
#         print(f"{i} простое число")
##########################2
# print("таблица умножения")
# for i in range(1, 11):
#    for j in range(1, 11):
#         print(f"{i}x{j}={i * j}", end='   ')
#    print()

####################3
a = int(input("Введите начало диапазона для умножения:"))
b = int(input("Введите конец диапазона для умножения:"))
for i in range(1, 11):
    print(f"{a}x{i}={i * a}", end='  ')
print()
print(".............................................................................")
for j in range(1, 11):
    print(f"{b}x{j}={j * b}", end='  ')







